{"modelTopology":{"class_name":"Model","config":{"name":"3layer_mlp","layers":[{"name":"input_layer","class_name":"InputLayer","config":{"batch_input_shape":[null,60],"dtype":"float32","sparse":false,"name":"input_layer"},"inbound_nodes":[]},{"name":"dense","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense","trainable":true},"inbound_nodes":[[["input_layer",0,0,{}]]]},{"name":"dense_1","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_1","trainable":true},"inbound_nodes":[[["dense",0,0,{}]]]},{"name":"dense_2","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_2","trainable":true},"inbound_nodes":[[["dense_1",0,0,{}]]]}],"input_layers":[["input_layer",0,0]],"output_layers":[["dense_2",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense/kernel","shape":[60,32],"dtype":"float32"},{"name":"dense/bias","shape":[32],"dtype":"float32"},{"name":"dense_1/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_1/bias","shape":[16],"dtype":"float32"},{"name":"dense_2/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_2/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}